In [3]:
import pandas as pd
import numpy as np

In [27]:
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'

In [28]:
tips = pd.read_csv(url)

In [30]:
tips.shape

(244, 7)

In [41]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [35]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.4+ KB

In [38]:
# The describe method shows basic statistical characteristics of each numerical feature

In [31]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [ ]:
# to see statistics on non-numerical features, one has to explicitly indicate data types of interested columns
# in the include parameter.

In [36]:
tips.describe(include= ['object'])

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

# for categorial columns we can use the below for quick counts

In [90]:
tips['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

# Using  'normalize = True' gives us the percentage

In [95]:
tips['sex'].value_counts(normalize = True)

Male      0.643443
Female    0.356557
Name: sex, dtype: float64

In [32]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# SELECT

In [55]:
selection = ['day','time','sex']

tips[selection].head(10)

#  this also works:  tips [['day','time','sex','size']]

   day    time     sex
0  Sun  Dinner  Female
1  Sun  Dinner    Male
2  Sun  Dinner    Male
3  Sun  Dinner    Male
4  Sun  Dinner  Female
5  Sun  Dinner    Male
6  Sun  Dinner    Male
7  Sun  Dinner    Male
8  Sun  Dinner    Male
9  Sun  Dinner    Male

# WHERE

In [43]:
tips[(tips['sex'] == 'Male')].head()

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

# SELECT & WHERE

In [105]:
selection = ['day','time','sex' , 'size']
tips[(tips['sex'] == 'Male')][selection].head()

   day    time   sex  size
1  Sun  Dinner  Male     3
2  Sun  Dinner  Male     3
3  Sun  Dinner  Male     2
5  Sun  Dinner  Male     4
6  Sun  Dinner  Male     2

In [104]:
tips[(tips['sex'] == 'Male')]['day'].head()

1    Sun
2    Sun
3    Sun
5    Sun
6    Sun
Name: day, dtype: object

# REPLACE VALUES IN THE COLUMN BY USING MAP
# here we have created a new column sex_new and passing a dictionary of the form {old value : new value}

In [110]:
d = {'Male': 'M' , 'Female': 'F' }

tips['sex_new'] = tips['sex'].map(d)
tips.head()

   total_bill   tip     sex smoker  day    time  size sex_new
0       16.99  1.01  Female     No  Sun  Dinner     2       F
1       10.34  1.66    Male     No  Sun  Dinner     3       M
2       21.01  3.50    Male     No  Sun  Dinner     3       M
3       23.68  3.31    Male     No  Sun  Dinner     2       M
4       24.59  3.61  Female     No  Sun  Dinner     4       F

In [120]:
d = {'Male': 1 , 'Female': 0 }
y = tips
y = y.replace({'sex': d})
y.head()

   total_bill   tip  sex smoker  day    time  size sex_new
0       16.99  1.01    0     No  Sun  Dinner     2       F
1       10.34  1.66    1     No  Sun  Dinner     3       M
2       21.01  3.50    1     No  Sun  Dinner     3       M
3       23.68  3.31    1     No  Sun  Dinner     2       M
4       24.59  3.61    0     No  Sun  Dinner     4       F

# Null & Not Null

In [71]:
frame = pd.DataFrame({'col1': ['A', 'B', np.NaN, 'C', 'D'],'col2': ['F', np.NaN, 'G', 'H', 'I']})
frame

  col1 col2
0    A    F
1    B  NaN
2  NaN    G
3    C    H
4    D    I

In [87]:
#check if dataframe has null

frame.isnull()

    col1   col2
0  False  False
1  False   True
2   True  False
3  False  False
4  False  False

# Check if the dataframe has any of the columns values as null

In [81]:
frame.isnull().any()

col1    True
col2    True
dtype: bool

# How may nulls in the column

In [85]:
frame.isnull().sum()

col1    1
col2    1
dtype: int64

# Check for the null in a given column

In [72]:
#NULL
frame[frame['col2'].isnull()]

  col1 col2
1    B  NaN

In [73]:
#NOT NULL

frame[frame['col1'].notnull()]

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

# ORDER BY

In [97]:

tips.sort_values(['day','sex'], ascending = [True,False]).head()

    total_bill   tip   sex smoker  day    time  size
90       28.97  3.00  Male    Yes  Fri  Dinner     2
91       22.49  3.50  Male     No  Fri  Dinner     2
95       40.17  4.73  Male    Yes  Fri  Dinner     4
96       27.28  4.00  Male    Yes  Fri  Dinner     2
97       12.03  1.50  Male    Yes  Fri  Dinner     2

In [101]:
tips.sort_values('sex', ascending = True).head()

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
139       13.16  2.75  Female     No  Thur   Lunch     2
137       14.15  2.00  Female     No  Thur   Lunch     2
136       10.33  2.00  Female     No  Thur   Lunch     2
135        8.51  1.25  Female     No  Thur   Lunch     2

# GROUP BY

In [56]:
tips.groupby(['sex','day']).size()

sex     day
Female  Fri      9
        Sat     28
        Sun     18
        Thur    32
Male    Fri     10
        Sat     59
        Sun     58
        Thur    30
dtype: int64

In [57]:
tips.groupby(['sex']).size()

sex
Female     87
Male      157
dtype: int64

In [58]:
tips.groupby(['sex','day']).count()

             total_bill  tip  smoker  time  size
sex    day
Female Fri            9    9       9     9     9
       Sat           28   28      28    28    28
       Sun           18   18      18    18    18
       Thur          32   32      32    32    32
Male   Fri           10   10      10    10    10
       Sat           59   59      59    59    59
       Sun           58   58      58    58    58
       Thur          30   30      30    30    30

# Use below to apply different function to your columns during the group by

In [61]:
tips.groupby(['sex','day']).agg({'tip': np.mean ,'total_bill': np.max})

                  tip  total_bill
sex    day
Female Fri   2.781111       22.75
       Sat   2.801786       44.30
       Sun   3.367222       35.26
       Thur  2.575625       43.11
Male   Fri   2.693000       40.17
       Sat   3.083898       50.81
       Sun   3.220345       48.17
       Thur  2.980333       41.19

# Alternatively you can also do below  . This is clean as you know what functions are applied to your columns

In [89]:
tips.groupby(['sex','day'])['tip','total_bill'].agg([np.mean,np.max])

                  tip        total_bill
                 mean   amax       mean   amax
sex    day
Female Fri   2.781111   4.30  14.145556  22.75
       Sat   2.801786   6.50  19.680357  44.30
       Sun   3.367222   5.20  19.872222  35.26
       Thur  2.575625   5.17  16.715312  43.11
Male   Fri   2.693000   4.73  19.857000  40.17
       Sat   3.083898  10.00  20.802542  50.81
       Sun   3.220345   6.50  21.887241  48.17
       Thur  2.980333   6.70  18.714667  41.19

# AND &  OR |

In [47]:
tips[( (tips['sex'] == 'Male') &  (tips['day'] == 'Sun')   ) | (tips['time'] == 'Lunch') ].tail(10)

     total_bill   tip     sex smoker   day   time  size
203       16.40  2.50  Female    Yes  Thur  Lunch     2
204       20.53  4.00    Male    Yes  Thur  Lunch     4
205       16.47  3.23  Female    Yes  Thur  Lunch     3
220       12.16  2.20    Male    Yes   Fri  Lunch     2
221       13.42  3.48  Female    Yes   Fri  Lunch     2
222        8.58  1.92    Male    Yes   Fri  Lunch     1
223       15.98  3.00  Female     No   Fri  Lunch     3
224       13.42  1.58    Male    Yes   Fri  Lunch     2
225       16.27  2.50  Female    Yes   Fri  Lunch     2
226       10.09  2.00  Female    Yes   Fri  Lunch     2

In [11]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})
df1

  key     value
0   A -0.831429
1   B -0.192174
2   C  0.414154
3   D  0.235734

In [12]:
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'],'value': np.random.randn(4)})
df2

  key     value
0   B  1.514705
1   D -0.179455
2   D -2.050860
3   E -0.095349

# SELECT * FROM df1 INNER JOIN df2   ON df1.key = df2.key;

In [19]:
# merge performs an INNER JOIN by default
pd.merge(df1, df2, on='key',how= 'inner')

  key   value_x   value_y
0   B -0.192174  1.514705
1   D  0.235734 -0.179455
2   D  0.235734 -2.050860

In [15]:
df1

  key     value
0   A -0.831429
1   B -0.192174
2   C  0.414154
3   D  0.235734

In [16]:
# merge() also offers parameters for cases when you’d like to join one DataFrame’s column with another DataFrame’s index.
indexed_df2 = df2.set_index('key')
indexed_df2

        value
key
B    1.514705
D   -0.179455
D   -2.050860
E   -0.095349

In [14]:
pd.merge(df1, indexed_df2, left_on='key', right_index=True)

  key   value_x   value_y
1   B -0.192174  1.514705
3   D  0.235734 -0.179455
3   D  0.235734 -2.050860

# SELECT * FROM df1 LEFT OUTER JOIN df2   ON df1.key = df2.key;

In [17]:
pd.merge(df1, df2 , on='key',how='left')

  key   value_x   value_y
0   A -0.831429       NaN
1   B -0.192174  1.514705
2   C  0.414154       NaN
3   D  0.235734 -0.179455
4   D  0.235734 -2.050860

# SELECT * FROM df1 FULL OUTER JOIN df2 ON df1.key = df2.key

In [20]:
pd.merge(df1, df2, on='key', how='outer')

  key   value_x   value_y
0   A -0.831429       NaN
1   B -0.192174  1.514705
2   C  0.414154       NaN
3   D  0.235734 -0.179455
4   D  0.235734 -2.050860
5   E       NaN -0.095349

# UNION ALL  & UNION

In [21]:
df1 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'],
                      'rank': range(1, 4)})

In [22]:
df2 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'],
                    'rank': [1, 4, 5]})

In [25]:
# UNION ALL
pd.concat([df1, df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [26]:
# UNION 

pd.concat([df1, df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5